-- phpMyAdmin SQL Dump
-- version 4.9.5deb2
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Фев 26 2023 г., 23:33
-- Версия сервера: 8.0.32-0ubuntu0.20.04.2
-- Версия PHP: 7.4.3-4ubuntu2.17

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `my_shop_one`
--

-- --------------------------------------------------------

--
-- Структура таблицы `Студенты`
--

CREATE TABLE `Студенты` (
  `id` int NOT NULL,
  `ФИО` varchar(255) NOT NULL,
  `Дата рождения` date NOT NULL,
  `Название ВУЗа` varchar(255) NOT NULL,
  `Специальность` varchar(255) NOT NULL,
  `Курс` tinyint NOT NULL,
  `Размер стипендии` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `Студенты`
--

INSERT INTO `Студенты` (`id`, `ФИО`, `Дата рождения`, `Название ВУЗа`, `Специальность`, `Курс`, `Размер стипендии`, `created_at`) VALUES
(1, 'Алексеева Мария Николаевна', '1995-07-01', 'МГУ', 'Филология', 2, '2000', '2023-02-26 13:37:52'),
(2, 'Николаев Марк Юрьевич', '1996-11-02', 'МГУ', 'Информационная безопасность', 1, '1000', '2023-02-26 14:08:29'),
(3, 'Романова Юлия Андреевна', '1986-05-12', 'РУДН', 'Мировая экономика', 5, '4000', '2023-02-26 14:08:29'),
(4, 'Сергеев Роман Андреевич', '1994-12-04', 'МАИ', 'Авиастроение', 2, '5000', '2023-02-26 14:08:29'),
(5, 'Николаева Мария Павловна', '1997-10-02', 'МГУ', 'Инновационный менеджмент', 3, '5000', '2023-02-26 14:08:29'),
(6, 'Александров Михаил Викторович', '1995-06-05', 'РУДН', 'Иностранный язык', 2, '10000', '2023-02-26 14:08:29'),
(7, 'Петрова Анна Викторовна', '1993-01-02', 'МАИ', 'Самолето- и вертолетостроение', 2, '10000', '2023-02-26 14:08:29'),
(8, 'Пушкин Валерий Павлович', '1992-04-12', 'МГУ', 'Информационная безопасность', 4, '1000', '2023-02-26 14:08:29'),
(9, 'Туманова Елизавета Александровна', '2004-10-02', 'МГУ', 'Информационная безопасность', 3, NULL, '2023-02-26 14:08:29'),
(10, 'Каримов Иван Петрович', '1998-10-22', 'РУДН', 'Филология', 2, '1000', '2023-02-26 14:08:29'),
(11, 'Мариева Светлана Сергеевна', '1997-11-23', 'МАИ', 'Авиастроение', 5, NULL, '2023-02-26 14:08:29'),
(12, 'Павлов Игорь Алексеевич', '1990-10-12', 'РУДН', 'Информационная безопасность', 3, '1000', '2023-02-26 14:08:29'),
(13, 'Кулешов Геннадий Иванович', '1989-10-09', 'МГУ', 'Менеджмент', 2, '1000', '2023-02-26 14:08:29'),
(14, 'Карманова Маргарита Сергеевна', '2005-05-19', 'МАИ', 'Информационная безопасность', 1, '2000', '2023-02-26 14:08:29'),
(15, 'Саврасов Иван Алексеевич', '1996-10-11', 'МАИ', 'Авиастроение', 4, '1000', '2023-02-26 14:08:29'),
(16, 'Муравьёв Савелий Анатольевич', '1999-04-29', 'МГУ', 'Менеджмент', 2, '5000', '2023-02-26 14:08:29'),
(17, 'Ефимов Игнат Семенович', '1989-11-29', 'МГУ', 'Прикладная математика', 4, '1000', '2023-02-26 14:08:29'),
(18, 'Елисеева Аврора Семёновна', '1987-03-05', 'РУДН', 'Иннновационный менеджмент', 5, '4000', '2023-02-26 14:08:29'),
(19, 'Данилова Стелла Артемовна', '1994-11-25', 'РУДН', 'Информационная безопасность', 2, '1000', '2023-02-26 14:08:29'),
(20, 'Мартынов Давид Фролович', '1993-04-04', 'МАИ', 'Информационная безопасность', 1, '10000', '2023-02-26 14:08:29');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `Студенты`
--
ALTER TABLE `Студенты`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `Студенты`
--
ALTER TABLE `Студенты`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
